# Working with sqlite database

In [1]:
import sqlite3

In [2]:
# creating a new database or connecting to existing database
conn = sqlite3.connect("mydatabase.db")

In [3]:
# creating a table in a database

In [5]:
query = "create table if not exists customers( cid number primary key not null, name text not null, city text, age number, gender text);"

conn.execute(query)

In [8]:
# inserting data in a table
query = "insert into customers (cid,name,city,age,gender) values (?,?,?,?,?);"

In [9]:
conn.execute(query,(1,"Anshu",'Delhi',45,'Male'))

In [10]:
conn.execute(query,(2,"John",'Delhi',23,'Male'))

In [11]:
conn.execute(query,(3,"Fitria",'Jakarta',22,'Female'))

In [14]:
# fetching data form the database
query = "select * from customers"
data = conn.execute(query)
for i in data:
    print(i)

(1, 'Anshu', 'Delhi', 45, 'Male')
(2, 'John', 'Delhi', 23, 'Male')
(3, 'Fitria', 'Jakarta', 22, 'Female')

In [15]:
import pandas as pd

In [16]:
df = pd.read_sql_query(query,conn)

In [17]:
df

   cid    name     city  age  gender
0    1   Anshu    Delhi   45    Male
1    2    John    Delhi   23    Male
2    3  Fitria  Jakarta   22  Female